In [1]:
%load_ext sql
%sql sqlite://

### 1. Create & Fill Tables

In [2]:
%%sql

CREATE TABLE employees(
    employee_id INTEGER,
    employee_name TEXT,
    department_id TEXT
);

CREATE TABLE departments(
    id INTEGER,
    department_name TEXT
);

INSERT INTO 
    employees (employee_id, employee_name, department_id)
VALUES 
    (1, "Homer Simpson", 4),
    (2, "Ned Flanders", 1),
    (3, "Barney Gumble", 5),
    (4, "Clancy Wiggum", 3),
    (5, "Moe Syzslak", NULL);

INSERT INTO 
    departments (id, department_name)
VALUES 
    (1, "Sales"),
    (2, "Engineering"),
    (3, "Human Resources"),
    (4, "Customer Service"),
    (5, "Research & Development");

 * sqlite://
Done.
Done.
5 rows affected.
5 rows affected.

[]

### 1-1.Table:  __`employees`__

- employee_id
- emplyee_name
- department_id

In [3]:
%%sql 
select * 
from employees

 * sqlite://
Done.

[(1, 'Homer Simpson', '4'),
 (2, 'Ned Flanders', '1'),
 (3, 'Barney Gumble', '5'),
 (4, 'Clancy Wiggum', '3'),
 (5, 'Moe Syzslak', None)]

### 1-2. Table: __`departments`__

- id
- department_name

In [4]:
%%sql 
select * 
from departments

 * sqlite://
Done.

[(1, 'Sales'),
 (2, 'Engineering'),
 (3, 'Human Resources'),
 (4, 'Customer Service'),
 (5, 'Research & Development')]

### ***

### 2. `JOIN - (INNER JOIN)`

- The SQL JOIN command is used to combine data from two tables in SQL 
- The JOIN clause is often used when tables have at least one column of data in common

#### Query: Write a query to JOIN the tables created

In [5]:
%%sql

SELECT *
    FROM employees
    JOIN departments ON employees.department_id = departments.id
ORDER BY department_id;

 * sqlite://
Done.

[(2, 'Ned Flanders', '1', 1, 'Sales'),
 (4, 'Clancy Wiggum', '3', 3, 'Human Resources'),
 (1, 'Homer Simpson', '4', 4, 'Customer Service'),
 (3, 'Barney Gumble', '5', 5, 'Research & Development')]

### 2-2. `LEFT JOIN `

- A LEFT JOIN returns all the rows that are in the first (left) table listed. Matching rows from the right table are also returned

In [6]:
%%sql 

SELECT * 
    FROM employees AS emp
    LEFT JOIN departments AS dep ON emp.department_id = dep.id;

 * sqlite://
Done.

[(1, 'Homer Simpson', '4', 4, 'Customer Service'),
 (2, 'Ned Flanders', '1', 1, 'Sales'),
 (3, 'Barney Gumble', '5', 5, 'Research & Development'),
 (4, 'Clancy Wiggum', '3', 3, 'Human Resources'),
 (5, 'Moe Syzslak', None, None, None)]

### 2-3. `RIGHT JOIN`

- __NOTE__: EMULATED by doing a left join & switching the tables

In [7]:
%%sql 

SELECT * 
    FROM departments AS dep
    LEFT JOIN employees AS emp ON dep.id = emp.department_id;

 * sqlite://
Done.

[(1, 'Sales', 2, 'Ned Flanders', '1'),
 (2, 'Engineering', None, None, None),
 (3, 'Human Resources', 4, 'Clancy Wiggum', '3'),
 (4, 'Customer Service', 1, 'Homer Simpson', '4'),
 (5, 'Research & Development', 3, 'Barney Gumble', '5')]

### ***

### 3. Create & Fill Tables II

In [8]:
%%sql

CREATE TABLE Orders(
    OrderID INTEGER,
    CustomerID INTEGER,
    OrderDate DATE
);

CREATE TABLE Customers(
    CustomerID INTEGER,
    CustomerName TEXT,
    ContactName TEXT,
    Country TEXT
);

INSERT INTO 
    Orders (OrderID, CustomerID, OrderDate)
VALUES 
    (10308, 2, '1996-09-18'),
    (10309, 37, '1996-09-19'),
    (10310, 77, '1996-09-20');
    
INSERT INTO 
    Customers (CustomerID, CustomerName, ContactName, Country)
VALUES 
    (1, 'Alfreds Futterkiste', 'Maria Anders', 'Germany'),
    (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Mexico'),
    (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mexico');

 * sqlite://
Done.
Done.
3 rows affected.
3 rows affected.

[]

### 3-1. Table: __`Orders`__

In [9]:
%%sql
select * 
from Orders

 * sqlite://
Done.

[(10308, 2, '1996-09-18'),
 (10309, 37, '1996-09-19'),
 (10310, 77, '1996-09-20')]

### 3-2. Table: __`Customers`__

In [10]:
%%sql
select * 
from Customers

 * sqlite://
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mexico')]

### 4. `INNER JOIN II`
#### INNER JOIN: Selects ONLY the records that have `MATCHING VALUES` in both tables

In [11]:
%%sql

SELECT Orders.OrderID, 
       Customers.CustomerName, 
       Orders.OrderDate
FROM Orders JOIN Customers ON Orders.CustomerID = Customers.CustomerID;

 * sqlite://
Done.

[(10308, 'Ana Trujillo Emparedados y helados', '1996-09-18')]

### 4-1. `LEFT JOIN`
#### LEFT (OUTER) JOIN: Returns all records from the left table & the MATCHED records from the right table

In [12]:
%%sql

SELECT Orders.OrderID, 
       Customers.CustomerName, 
       Orders.OrderDate
FROM Orders LEFT JOIN Customers ON Orders.CustomerID = Customers.CustomerID;

 * sqlite://
Done.

[(10308, 'Ana Trujillo Emparedados y helados', '1996-09-18'),
 (10309, None, '1996-09-19'),
 (10310, None, '1996-09-20')]

### 4-2. `RIGHT JOIN`
#### RIGHT (OUTER) JOIN: Returns all records from the right table & the MATCHED records from the left table
- __NOTE__: EMULATED by doing a left join & switching the tables

In [13]:
%%sql

SELECT Orders.OrderID, 
       Customers.CustomerName, 
       Orders.OrderDate
FROM Customers LEFT JOIN Orders ON Customers.CustomerID =  Orders.CustomerID;

 * sqlite://
Done.

[(None, 'Alfreds Futterkiste', None),
 (10308, 'Ana Trujillo Emparedados y helados', '1996-09-18'),
 (None, 'Antonio Moreno Taquería', None)]

### 4-3. `FULL JOIN`

#### FULL OUTER JOIN: Returns all records when there is a match in left or right table records
- **NOTE**: EMULATED: the result of LEFT & RIGHT (again swapped LEFT JOIN) JOIN results

In [14]:
%%sql

SELECT Orders.OrderID, 
       Customers.CustomerName, 
       Orders.OrderDate
FROM Orders LEFT JOIN Customers ON Orders.CustomerID = Customers.CustomerID
UNION
SELECT Orders.OrderID, 
       Customers.CustomerName, 
       Orders.OrderDate
FROM Customers LEFT JOIN Orders ON Customers.CustomerID =  Orders.CustomerID;

 * sqlite://
Done.

[(None, 'Alfreds Futterkiste', None),
 (None, 'Antonio Moreno Taquería', None),
 (10308, 'Ana Trujillo Emparedados y helados', '1996-09-18'),
 (10309, None, '1996-09-19'),
 (10310, None, '1996-09-20')]

### 5. Create & Fill Tables III

In [15]:
%%sql

CREATE TABLE Customers2(
    CustomerID INTEGER,
    CustomerName TEXT,
    ContactName TEXT,
    Address TEXT,
    City TEXT,
    PostCode INTEGER,
    Country TEXT
);

CREATE TABLE Suppliers(
    SupplierID INTEGER,
    SupplierName TEXT,
    ContactName TEXT,
    Address TEXT,
    City TEXT,
    PostCode TEXT,
    Country TEXT
);

INSERT INTO 
    Customers2 (CustomerID, CustomerName, ContactName, Address, City, PostCode, Country)
VALUES 
    (1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', 12209, 'Germany'),
    (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'Mexico City', 
     05021, 'Mexico'),
    (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'Mexico City', 05023, 'Mexico');
    
INSERT INTO 
    Suppliers (SupplierID, SupplierName, ContactName, Address, City, PostCode, Country)
VALUES 
    (1, 'Exotic Liquid', 'Charlotte Cooper', '49 Gilbert St.', 'London', 'EC1 4SD', 'UK'),
    (2, 'New Orleans Cajun Delights', 'Shelley Burke', 'P.O. Box 78934', 'New Orleans', '70117', 'USA'),
    (3, "Grandma Kelly's Homestead", 'Regina Murphy', '707 Oxford Rd.', 'Ann Arbor', '48104', 'USA');

 * sqlite://
Done.
Done.
3 rows affected.
3 rows affected.

[]

### 5-1. Table: __`Customers2`__

In [16]:
%%sql
select * from Customers2

 * sqlite://
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', 12209, 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'Mexico City', 5021, 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'Mexico City', 5023, 'Mexico')]

### 5-2. Table: __`Suppliers`__

In [17]:
%%sql
select * from Suppliers

 * sqlite://
Done.

[(1, 'Exotic Liquid', 'Charlotte Cooper', '49 Gilbert St.', 'London', 'EC1 4SD', 'UK'),
 (2, 'New Orleans Cajun Delights', 'Shelley Burke', 'P.O. Box 78934', 'New Orleans', '70117', 'USA'),
 (3, "Grandma Kelly's Homestead", 'Regina Murphy', '707 Oxford Rd.', 'Ann Arbor', '48104', 'USA')]

### 6. `SQL UNION`
#### UNION: Combines the result-set of two or more SELECT statements.

- Every __SELECT__ statement within __UNION__ must have the same number of columns
- The columns must also have similar data types
- The columns in every __SELECT__ statement must also be in the same order

In [18]:
%%sql
SELECT City FROM Customers2
UNION
SELECT City FROM Suppliers
ORDER BY City;

 * sqlite://
Done.

[('Ann Arbor',), ('Berlin',), ('London',), ('Mexico City',), ('New Orleans',)]

### 6.1 Use `UNION ALL` to also select duplicate values

In [19]:
%%sql
SELECT City FROM Customers2
UNION ALL
SELECT City FROM Suppliers
ORDER BY City;

 * sqlite://
Done.

[('Ann Arbor',),
 ('Berlin',),
 ('London',),
 ('Mexico City',),
 ('Mexico City',),
 ('New Orleans',)]

### 6.3 Using UNION with WHERE

In [20]:
%%sql
SELECT City, Country FROM Customers2
WHERE Country='Germany'
UNION
SELECT City, Country FROM Suppliers
WHERE Country='Germany'
ORDER BY City;

 * sqlite://
Done.

[('Berlin', 'Germany')]

### 6.4 Create a temporary column named "Type", that list whether the contact person is a Customer or a Supplier

In [21]:
%%sql
SELECT 'Customer' AS Type, 
        ContactName, 
        City, 
        Country
FROM Customers2
UNION
SELECT 'Supplier', 
       ContactName, 
       City, 
       Country
FROM Suppliers;

 * sqlite://
Done.

[('Customer', 'Ana Trujillo', 'Mexico City', 'Mexico'),
 ('Customer', 'Antonio Moreno', 'Mexico City', 'Mexico'),
 ('Customer', 'Maria Anders', 'Berlin', 'Germany'),
 ('Supplier', 'Charlotte Cooper', 'London', 'UK'),
 ('Supplier', 'Regina Murphy', 'Ann Arbor', 'USA'),
 ('Supplier', 'Shelley Burke', 'New Orleans', 'USA')]